app/Domestic/Files/24/IssueTicketRQ.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:ns1="http://booking.us.org/">
   <SOAP-ENV:Body>
     <ns1:IssueTicket>
       <strFlightId>7347d951-6c0e-4eee-bd09-f24ed20847ca</strFlightId><strReturnFlightId>f1ab2782-e2d4-442f-9913-f46dd336257c</strReturnFlightId>
       <strContactName>sdds</strContactName><strContactEmail>test@test.com</strContactEmail><strContactMobile>5213789652</strContactMobile>
       <strPassengerDetail><![CDATA[<?xml version="1.0"?><PassengerDetail>
       <Passenger><PaxType>ADULT</PaxType><Title>Mr</Title><Gender>M</Gender><FirstName>dsdas</FirstName><LastName>fgfd</LastName><Nationality>NP</Nationality><PaxRemarks>gdfgfdgdfgd</PaxRemarks></Passenger>
 </PassengerDetail>]]></strPassengerDetail>
     </ns1:IssueTicket>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>